NextFOAM-24/tutorials/incompressible/simpleFoam/pipeCyclic/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

canCompile || exit 0    # Dynamic code

restore0Dir

runApplication blockMesh

runApplication topoSet

runApplication refineHexMesh c0 -overwrite

runApplication decomposePar -cellDist

runParallel $(getApplication)

runApplication reconstructPar

#------------------------------------------------------------------------------
